{
  "version": "2.3.0",
  "summary": {
    "title": "TDragon-lab",
    "owner": "Karime Linhares Silva Muniz - 2416877",
    "description": "O TDragon é um projeto que implementa uma aplicação de tela de login integrada ao AWS Cognito e S3, com foco em segurança e modelagem de vulnerabilidades. Seu objetivo principal é atuar como um ambiente de testes para identificar e mitigar possíveis falhas em processos de autenticação e armazenamento de dados. \nFuncionalidades Principais:\nAutenticação com AWS Cognito: Utiliza o Cognito para gerenciar usuários, autenticação e autorização de forma segura e escalável.\nArmazenamento de Logs no AWS S3: Todos os eventos e logs gerados pela aplicação são armazenados no Amazon S3, permitindo auditoria e monitoramento.\nPersistência de Dados com Docker: Os dados do usuário são armazenados utilizando volumes do Docker, garantindo portabilidade e isolamento do ambiente. Objetivo:\nO TDragon foi desenvolvido para simular um cenário real de aplicação, sendo utilizado como ferramenta de testes para modelagem de vulnerabilidades. Ele permite que equipes de segurança analisem pontos críticos na autenticação, armazenamento e gerenciamento de logs, além de explorar possíveis vetores de ataque em um ambiente controlado.\nTecnologias Utilizadas:\nFrontend: Tela de login responsiva e simples para interação do usuário.\nBackend: Integração com AWS Cognito e comunicação segura com S3 para armazenar logs.\nInfraestrutura: Containerização com Docker e Dockerfile para garantir a padronização e isolamento do ambiente. O TDragon serve como uma base para experimentos e aprimoramento contínuo em segurança da informação, promovendo boas práticas no desenvolvimento de sistemas.",
    "id": 0
  },
  "detail": {
    "contributors": [],
    "diagrams": [
      {
        "id": 0,
        "title": "TDragon-lab",
        "diagramType": "STRIDE",
        "placeholder": "New STRIDE diagram description",
        "thumbnail": "./public/content/images/thumbnail.stride.jpg",
        "version": "2.3.0",
        "cells": [],
        "description": "Diagrama de fluxo para o projeto de aplicação de login, de nome TDragon, que é uma tela de login, ligado ao cognito e ao s3, para configuração e armazenamento de logs, e usa o dockerfile para armazenamento de dados do usuário."
      }
    ],
    "diagramTop": 1,
    "reviewer": "",
    "threatTop": 0
  }
}